Revit 2024 API
AnalysisDisplayDiagramSettings.IsEqual Method
 Compares two diagram settings objects.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool IsEqual(
	AnalysisDisplayDiagramSettings other
)
Visual Basic
Public Function IsEqual ( _
	other As AnalysisDisplayDiagramSettings _
) As Boolean
Visual C++
public:
bool IsEqual(
	AnalysisDisplayDiagramSettings^ other
)
Parameters
other
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings
 Diagram settings object to compare with.
Return Value
 True if objects are equal, false otherwise.
See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace